
## Plan Result

[CI link](https://github.com/clov3r-cc/infra/actions/runs/20979081356)


<pre><code>Plan: 0 to add, 2 to change, 0 to destroy.</code></pre>

* Update
  * ansible_host.windows_operator[&#34;01&#34;]
  * proxmox_vm_qemu.windows_operator[&#34;01&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # ansible_host.windows_operator["01"] will be updated in-place
  ~ resource "ansible_host" "windows_operator" {
        id        = "prd-wop-01"
        name      = "prd-wop-01"
      ~ variables = {
          - "ansible_host" = "192.168.21.18"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # proxmox_vm_qemu.windows_operator["01"] will be updated in-place
  ~ resource "proxmox_vm_qemu" "windows_operator" {
      + default_ipv4_address      = (known after apply)
        id                        = "pve-01/qemu/105"
        name                      = "prd-wop-01"
      + ssh_host                  = (known after apply)
      + ssh_port                  = (known after apply)
        tags                      = "operator;prd;terraform;windows-operator"
      ~ vm_state                  = "stopped" -> "running"
        # (48 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"tf_plan","PRNumber":251,"Program":"tfcmt","SHA1":"e292e077a09072b27beaed0a634b4b73db120764","Vars":{},"WorkflowName":"Terraform CI"} -->